package Ex01x05;

//Є N клієнтів, яким компанія-виробник має доставити товар. Скільки є можливих маршрутів доставлення товару з урахуванням того, що товар доставлятиме одна машина? Використовуючи IntelliJ IDEA, створіть клас Delivery. Напишіть програму, яка розраховуватиме та виводитиме на екран кількість можливих варіантів доставлення товару. Для розв'язку задачі, використовуйте факторіал N!, що розраховується рекурсією. Поясніть, чому не рекомендується використовувати рекурсію для розрахунку факторіала. Вкажіть слабкі місця цього підходу.



public class Ex15_2 {
    public static void main(String[] args) {
        System.out.println(factorial(6));



    }

    static int factorial(int n) {
        int result = 1;
        if (n == 1 || n == 0) {
            return result;
        }
        result = n * factorial(n - 1);
        return result;
    }
}
