//package Ex08x05;
//
//public class Matrixxxxxx {
//    //Створити клас "Матриця".
//    //Клас повинен мати такі змінні:
//    //1. двовимірний масив речових чисел;
//    //2. кількість рядків та стовпців у матриці.
//    //Клас повинен мати такі методи:
//    //1. додавання двовимірного масиву до двовимірного масиву;
//    //2. множення двовимірного масиву на число;
//    //3. виведення на друк обʼєкту Матриця;
//    //4. виведення на друк двовимірного масив після операцій над ним;
//    //5. множення двовимірного масиву на двовимірний масив.
//    int[][] array;
//    int rows;
//    int columns;
//
//    public int[][] getMatrix() {
//        return array;
//    }
//
//    // Первый конструктор
//    public Matrixxxxxx(int n, int m) {
//        rows = n;
//        columns = m;
//        array = new int[rows][columns];
//    }
//
//    // Второй конструктор
//    public Matrixxxxxx(int ar[][]) {
//        array = ar;
//        rows = array.length;
//        columns = array[0].length;
//    }
//
//
//
//}
